const commons = {
  아이디: '아이디',
  약관에_동의: '약관에 동의합니다',

  // 메인
  점메추_타이틀: '오늘 점심 뭐 먹을까 고민될 땐? 점메추!',
  점메추_AI: ' AI 메뉴추천',

  // 식당 찾기
  식당_검색: "식당 검색",
  주변_식당: '내 주변 식당 찾기',

  // 예약하기
  예약하기 : '예약하기',
  시간선택 : '시간을 선택해 주세요',
  인원선택 : '인원을 선택해 주세요',
  최대최소인원명수 : '1~10명까지 선택 가능합니다.',
  예약자_정보 : '예약자 정보',
  예약자 : '예약자',
  연락처 : '연락처',
  이메일 : '이메일',
  예약확인문구 : '예약 시 확인해 주세요',
  예약자당부문구 : '당일 취소 및 노쇼는 레스토랑뿐만 아니라 다른 고객님께도 피해가 될 수 있으므로 신중히 예약 부탁드립니다.',
  예약시간을_선택하세요 : '예약시간을 선택하세요.',
  예약자명을_입력하세요 : '예약자명을 입력하세요.',
  이메일을_입력하세요 : '이메일을 입력하세요.',
  휴대전화번호를_입력하세요 : '휴대전화번호를 입력하세요.',
  예약인원수를_선택하세요 : '예약인원수를 선택하세요.',


  // 결제하기
  예약결제하기 : '예약결제하기',
  결제하기 : '결제하기',

};

export default commons;
