const commons = {
  // 회원가입
  아이디: '아이디',
  약관에_동의: '약관에 동의합니다',
  회원명_입력: '회원명 입력',
  휴대전화번호_입력: '휴대전화번호 입력',
  

  // 로그인
  아이디_찾기: '아이디 찾기',
  비밀번호_찾기: '비밀번호 찾기',
  찾은_이메일: '찾으신 이메일은',
  아이디_다시찾기: '다시 찾기',
  '회원명을_입력하세요.': '회원명을 입력하세요',
  '휴대폰 번호를_입력하세요.': '휴대폰 번호를 입력하세요',

  // 마이페이지
  회원정보_수정: ' 회원정보 수정',
  이메일: '이메일',
  비밀번호: '비밀번호',
  이름: '이름',
  활동_지역: '활동지역',
  휴대전화: '휴대전화',
  작성한_리뷰: ' 작성한 리뷰',
  찜한_식당: ' 찜한 식당',
  수정하기: '수정하기',
  나가기: '나가기',
  마이_페이지: 'My page',
  이미지_업로드: '이미지 업로드',

  // 헤더
  사이트_관리: '사이트 관리',
  로그아웃: '로그아웃',
  회원가입: '회원가입',
  님_로그인: '님이 로그인 하셨습니다!',

  // 메인 메뉴
  식당_검색: '식당 검색',
  주변_식당: '내 주변 식당 찾기',
  점메추_AI: ' AI 식당 추천',
  나의_예약_내역: '나의 예약 내역',
  마이페이지: '마이페이지',

  // 메인
  점메추: '점메추, 고민 없는 미식생활의 시작',

  // 식당 검색
  지역_선택: '지역 선택',
  서울특별시_강동구: '서울특별시 강동구',
  서울특별시_강남구: '서울특별시 강남구',
  서울특별시_영등포구: '서울특별시 영등포구',
  서울특별시_은평구: '서울특별시 은평구',
  서울특별시_강북구: '서울특별시 강북구',
  서울특별시_종로구: '서울특별시 종로구',
  서울특별시_중구: '서울특별시 중구',
  서울특별시_용산구: '서울특별시 용산구',
  서울특별시_동작구: '서울특별시 동작구',
  서울특별시_성북구: '서울특별시 성북구',
  서울특별시_서대문구: '서울특별시 서대문구',
  서울특별시_도봉구: '서울특별시 도봉구',
  서울특별시_노원구: '서울특별시 노원구',
  서울특별시_동대문구: '서울특별시 동대문구',
  서울특별시_마포구: '서울특별시 마포구',
  서울특별시_성동구: '서울특별시 성동구',
  서울특별시_중랑구: '서울특별시 중랑구',
  서울특별시_구로구: '서울특별시 구로구',
  서울특별시_금천구: '서울특별시 금천구',
  서울특별시_서초구: '서울특별시 서초구',
  서울특별시_관악구: '서울특별시 관악구',
  서울특별시_강서구: '서울특별시 강서구',
  서울특별시_광진구: '서울특별시 광진구',
  서울특별시_양천구: '서울특별시 양천구',
  서울특별시_송파구: '서울특별시 송파구',

  음식종류_선택: '음식종류 선택',
  한식: '한식',
  중식: '중식',
  일식: '일식',
  분식: '분식',
  경양식: '경양식',
  패밀리레스토랑: '패밀리레스토랑',
  패스트푸드: '패스트푸드',
  치킨: '치킨',
  구이: '구이',
  회: '회',
  탕_국밥: '탕/국밥',
  냉면: '냉면',
  외국음식전문점: '외국음식전문점',
  커피: '커피',
  베이커리: '베이커리',

  통합검색: '통합검색',
  식당명: '식당명',
  연락처: '연락처',
  도로명_주소: '도로명 주소',
  지번_주소: '지번 주소',

  // 식당
  식당_목록: '식당 목록',

  주차_가능: '주차 가능',
  반려동물_동반: '반려동물 동반',
  유아시설: '유아시설',
  다국어_메뉴판: '다국어 메뉴판',
  무선인터넷: '무선인터넷',
  모바일_페이먼트: '모바일 페이먼트',
  스마트_오더: '스마트 오더',

  // 예약하기
  예약하기: '예약하기',
  시간선택: '시간을 선택해 주세요',
  인원선택: '인원을 선택해 주세요',
  최대최소인원명수: '1~10명까지 선택 가능합니다.',
  예약자_정보: '예약자 정보',
  예약자: '예약자',
  연락처: '연락처',
  이메일: '이메일',
  예약확인문구: '예약 시 확인해 주세요',
  예약자당부문구:
    '당일 취소 및 노쇼는 레스토랑뿐만 아니라 다른 고객님께도 피해가 될 수 있으므로 신중히 예약 부탁드립니다.',

  예약시간을_선택하세요: '예약시간을 선택하세요.',
  예약자명을_입력하세요: '예약자명을 입력하세요.',
  이메일을_입력하세요: '이메일을 입력하세요.',
  전화번호를_입력하세요: '전화번호를 입력하세요.',
  예약인원수를_선택하세요: '예약인원수를 선택하세요.',

  // 예약 내역
  예약_정보: '예약 정보',
  예약_정보_확인: '예약 정보 확인',
  예약_번호: '예약 번호',
  식당_주소: '식당 주소',
  식당_연락처: '식당 연락처',
  예약_일시: '예약 일시',
  예약_인원: '예약 인원',
  예약자_성함: '예약자 성함',
  전화번호: '전화번호',
  결제_금액: '결제 금액',
  취소하기: '취소하기',
  후기_작성하기: '후기 작성하기',
  예약_취소: '예약 취소',
  예약_날짜: '예약 날짜',
  예약_시간: '예약 시간',
  예약_확인하기: '예약 확인하기',
  정말_취소하겠습니까: '정말 취소하겠습니까?',

  // 결제하기
  예약결제하기: '예약결제하기',
  결제하기: '결제하기',
  식당_정보: '식당 정보',

  // AI
  JeomMechu_AI: 'AI 식당 추천',
};

export default commons;
